In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
names = ({1:'Abdullah',2: 'Saleh' , 3: 'Hamad'})
x = pd.Series(names)
x

1    Abdullah
2       Saleh
3       Hamad
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
x.index=[11,12,13]
x

11    Abdullah
12       Saleh
13       Hamad
dtype: object

## Q3: Retrieve First and second elements.

In [5]:
print(x[0:2])

11    Abdullah
12       Saleh
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [24]:
y = pd.Series({14:'Abdullah',15: 'Saleh' , 16: 'Ali'})
z = pd.concat((x,y))
print(z)
z.drop_duplicates(inplace=True)
z

11    Abdullah
12       Saleh
13       Hamad
14    Abdullah
15       Saleh
16         Ali
dtype: object

11    Abdullah
12       Saleh
13       Hamad
16         Ali
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [27]:
Students = {
    'ID': ['111', '222', '333', '444'],
    'Name': ['Abdullah', 'Ahmed', 'Salah', 'Faisal'],
    'GPA': [4.3, 4.2, 4.6, 3.1]
       }
Data = pd.DataFrame(Students)
Data

    ID      Name  GPA
0  111  Abdullah  4.3
1  222     Ahmed  4.2
2  333     Salah  4.6
3  444    Faisal  3.1

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [13]:
myfile = pd.read_csv('/Users/abdullah/Desktop/Tuwaiq/Week 2/Day 2/educ_figdp_1_Data.csv')
myfile.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [28]:
myfile.loc[0:7,['TIME','Value']]

   TIME Value
0  2000     :
1  2001     :
2  2002  5.00
3  2003  5.03
4  2004  4.95
5  2005  4.92
6  2006  4.91
7  2007  4.92

In [29]:
myfile[0:7]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e